app/controllers/api/boards_controller.rb

    def create
          @board = Board.new(board_params)
          @board_pins = [];
        if @board.save
---
INSERT INTO "boards" ("title", "description", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "second board"], ["description", "woohoo"], ["author_id", 16], ["created_at", "2021-02-12 18:15:21.000554"], ["updated_at", "2021-02-12 18:15:21.000554"]]