app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "age", "email", "password_digest", "created_at", "updated_at", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        @board_pins = []
        if @user.save