app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-02-11 18:45:43.956347"], ["session_token", "AoINPyuwFK06aOsSTghnTQ"], ["id", 17]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!