pinspo/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-02-09 00:03:15.985098"], ["session_token", "8aOC6y6xXOePzCQHkaeMxw"], ["id", 5]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!